Тест_ЗУП_31_КОРП/src/Catalogs/РежимыРаботыСотрудников/РежимыРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РежимыРаботыСотрудников</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммированныйУчетРабочегоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочейНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПраздники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияГрафиковРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочихДнейВНеделе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияНормыСуммированногоУчета</name>
    <type>
      <types>EnumRef.СпособыОпределенияНормыСуммированногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикНормыПриСуммированномУчете</name>
    <type>
      <types>CatalogRef.РежимыРаботыСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШаблонЗаполнения</name>
    <attributes>
      <name>ДеньВключенВГрафик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.СменыРаботыСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыВремени</name>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеОРабочихЧасах</name>
    <attributes>
      <name>НомерДняЦикла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/СпособыОпределенияНормыСуммированногоУчета/СпособыОпределенияНормыСуммированногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОпределенияНормыСуммированногоУчета</name>
  <enumValues>
    <name>ПоПроизводственномуКалендарю</name>
  </enumValues>
  <enumValues>
    <name>ПоДаннымЭтогоГрафика</name>
  </enumValues>
  <enumValues>
    <name>ПоДаннымДругогоГрафика</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/СпособыЗаполненияГрафиковРаботыСотрудников/СпособыЗаполненияГрафиковРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаполненияГрафиковРаботыСотрудников</name>
  <enumValues>
    <name>ПоНеделям</name>
  </enumValues>
  <enumValues>
    <name>ПоЦикламПроизвольнойДлины</name>
  </enumValues>
  <enumValues>
    <name>ПоСменам</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ГрафикиРаботыСотрудников/ГрафикиРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиРаботыСотрудников</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КалендарныеДни</name>
      <description>Календарные дни</description>
    </items>
  </predefined>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммированныйУчетРабочегоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочейНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеполноеРабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяРабочаяНеделя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеполныйРабочийДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикПолногоРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПраздники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияГрафиковРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочихДнейВНеделе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияНормыСуммированногоУчета</name>
    <type>
      <types>EnumRef.СпособыОпределенияНормыСуммированногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикНормыПриСуммированномУчете</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.РежимыРаботыСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШаблонЗаполнения</name>
    <attributes>
      <name>ДеньВключенВГрафик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.СменыРаботыСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыВремени</name>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеОРабочихЧасах</name>
    <attributes>
      <name>НомерДняЦикла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/РежимыРаботыСотрудников/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьНастройкиСпискаСпособовЗаполнения();
	
	Если Параметры.Ключ.Пустая() Тогда
		НомерТекущегоГода = Год(ТекущаяДатаСеанса());
		ЗаполнитьЗначенияПоУмолчанию();
		УстановитьОтображениеПолейСреднемесячныеНормыВремени();
		УстановитьДоступностьКомандыВводаШаблона(ЭтотОбъект);
	КонецЕсли;
		
	ОписаниеИспользуемыхВидовВремени = СписокВидовВремени.НайтиСтроки(Новый Структура("Использовать", Истина));
		
	НастроитьДоступностьЭлементов(ЭтаФорма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Расписания, "РежимРаботы", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	НомерТекущегоГода = Год(ТекущаяДатаСеанса());
	ПрочитатьСреднемесячныеНормыВремени();
	УстановитьОтображениеПолейСреднемесячныеНормыВремени();
	УстановитьДоступностьКомандыВводаШаблона(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСреднемесячныеНормыВремени();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СуммированныйУчетРабочегоВремениПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовСуммированногоУчета(ЭтаФорма);
	
	Если НЕ Объект.СуммированныйУчетРабочегоВремени Тогда
		Объект.СпособОпределенияНормыСуммированногоУчета = ПредопределенноеЗначение("Перечисление.СпособыОпределенияНормыСуммированногоУчета.ПустаяСсылка");
		Объект.ГрафикНормыПриСуммированномУчете = ПредопределенноеЗначение("Справочник.ГрафикиРаботыСотрудников.ПустаяСсылка");
	Иначе
		Объект.СпособОпределенияНормыСуммированногоУчета = ПредопределенноеЗначение("Перечисление.СпособыОпределенияНормыСуммированногоУчета.ПоПроизводственномуКалендарю");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияНормыСуммированногоУчетаПриИзменении(Элемент)
	УстановитьДоступностьГрафикаНормыПриСуммированномУчете(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СреднемесячноеЧислоДнейПриИзменении(Элемент)
	СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную = Истина; 
	УстановитьОтображениеПолейСреднемесячныеНормыВремени();
КонецПроцедуры

&НаКлиенте
Процедура СреднемесячноеЧислоЧасовПриИзменении(Элемент)
	СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную = Истина;
	УстановитьОтображениеПолейСреднемесячныеНормыВремени();
КонецПроцедуры

&НаКлиенте
Процедура ВидГрафикаПриИзменении(Элемент)
	УстановитьДоступностьКомандыВводаШаблона(ЭтотОбъект);
	
	Если Объект.СпособЗаполнения <> ПредопределенноеЗначение("Перечисление.СпособыЗаполненияГрафиковРаботыСотрудников.ПоСменам") Тогда
		Объект.ШаблонЗаполнения.Очистить();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПересчитатьСреднемесячныеЧислаЧасовИДней(Команда)
	ОбновитьСреднемесячныеНормыВремени();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьЭлементов(Форма)
	УстановитьДоступностьЭлементовСуммированногоУчета(Форма);	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовСуммированногоУчета(Форма)
		
	УстановитьДоступностьГрафикаНормыПриСуммированномУчете(Форма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьГрафикаНормыПриСуммированномУчете(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГрафикНормыПриСуммированномУчете",
		"Доступность",
		Форма.Объект.СпособОпределенияНормыСуммированногоУчета = ПредопределенноеЗначение("Перечисление.СпособыОпределенияНормыСуммированногоУчета.ПоДаннымДругогоГрафика"));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию()					
	Если Объект.ПроизводственныйКалендарь.Пустая() Тогда
		УстановитьПроизводственныйКалендарьПоУмолчанию();
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Объект.СпособЗаполнения = Перечисления.СпособыЗаполненияГрафиковРаботыСотрудников.ПоНеделям;
	КонецЕсли;	
	
	Если Объект.ДлительностьРабочейНедели = 0 Тогда
		Объект.ДлительностьРабочейНедели = 40;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьПроизводственныйКалендарьПоУмолчанию()	
	Объект.ПроизводственныйКалендарь = КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации();	
КонецПроцедуры		
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеДанныхГрафика" Тогда
		ПриИзмененииДанныхГрафикаНаСервере(Параметр);		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Расписания, "РежимРаботы", Объект.Ссылка);
	Элементы.Расписания.Обновить();
	ПрочитатьСреднемесячныеНормыВремени();
КонецПроцедуры

&НаКлиенте
Процедура РасписанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Перед началом добавления графиков, необходимо записать режим работы. Записать?'");
		Оповещение = Новый ОписаниеОповещения("ОбработкаОповещнияОЗаписиПриДобавленииГрафика", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	Иначе
		СоздатьНовыйГрафик();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещнияОЗаписиПриДобавленииГрафика(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
		Если Не Объект.Ссылка.Пустая() Тогда
			СоздатьНовыйГрафик();
		КонецЕсли;	
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйГрафик() Экспорт 
	ПараметрыГрафика = Новый Структура("РежимРаботы", Объект.Ссылка);
	ОткрытьФорму("Справочник.ГрафикиРаботыСотрудников.ФормаОбъекта", ПараметрыГрафика);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполнения(Команда)
	ТекущийШаблонЗаполнения = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.ШаблонЗаполнения Цикл
		ТекущийШаблонЗаполнения.Добавить(СтрокаТаблицы.Смена);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура("ШаблонЗаполнения", ТекущийШаблонЗаполнения);	
	ПараметрыОткрытия.Вставить("РежимРаботы", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактированияШаблонаЗаполнения", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.РежимыРаботыСотрудников.Форма.ШаблонЗаполнения", ПараметрыОткрытия, ,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияШаблонаЗаполнения(Результат, ДполнительнеыПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Модифицированность = Истина;
		Объект.ШаблонЗаполнения.Очистить();
		Для Каждого Смена Из Результат Цикл
			СтрокаШаблона = Объект.ШаблонЗаполнения.Добавить();
			СтрокаШаблона.Смена = Смена;
			Если ЗначениеЗаполнено(Смена) Тогда
				СтрокаШаблона.ДеньВключенВГрафик = Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСуществующийГрафик(Команда)
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Перед началом добавления графиков, необходимо записать режим работы. Записать?'");
		Оповещение = Новый ОписаниеОповещения("ОбработкаОповещнияОЗаписиПриПодбореГрафика", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОткрытьФормуПодбораГрафика();
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещнияОЗаписиПриПодбореГрафика(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
		Если Не Объект.Ссылка.Пустая() Тогда
			ОткрытьФормуПодбораГрафика();
		КонецЕсли;	
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораГрафика() Экспорт 
	ПараметрыОткрытияФормыВыбора = Новый Структура;
	ОтборГрафиков = Новый Структура("РежимРаботы", ПредопределенноеЗначение("Справочник.РежимыРаботыСотрудников.ПустаяСсылка"));
	ПараметрыОткрытияФормыВыбора.Вставить("Отбор", ОтборГрафиков);
	ПараметрыОткрытияФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытияФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.ГрафикиРаботыСотрудников.ФормаСписка", ПараметрыОткрытияФормыВыбора, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ГрафикиРаботыСотрудников") Тогда
		УстановитьРежимРаботыГрафику(ВыбранноеЗначение);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимРаботыГрафику(График)
	ГрафикОбъект = График.ПолучитьОбъект();
	
	Попытка 
		ГрафикОбъект.Заблокировать();
	Исключение
		ТекстИсключенияЗаписи = НСтр("ru = 'Не удалось изменить график работы.
				|Возможно, график работы редактируется другим пользователем'");
		ВызватьИсключение ТекстИсключенияЗаписи;
	КонецПопытки;	
	
	Если ЗначениеЗаполнено(ГрафикОбъект.РежимРаботы) Тогда
		ТекстИсключенияЗаписи = НСтр("ru = 'График относится к другому режиму работы'");
		ВызватьИсключение ТекстИсключенияЗаписи;
	КонецЕсли;
	
	ГрафикОбъект.РежимРаботы = Объект.Ссылка;
	ГрафикОбъект.Записать();
	
	Элементы.Расписания.Обновить();	
КонецПроцедуры	

&НаСервере
Процедура ПрочитатьСреднемесячныеНормыВремени()
	ДанныеСреднемесячныеНормыВремени = ДанныеСреднемесячныеНормыВремениГрафиковРаботыСотрудников(Объект.Ссылка, НомерТекущегоГода);
	ЗаполнитьЗначенияСвойств(СреднемесячныеНормыВремениГрафиковРаботыСотрудников, ДанныеСреднемесячныеНормыВремени);
	СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя = Новый ФиксированнаяСтруктура(ДанныеСреднемесячныеНормыВремени);
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьСреднемесячныеНормыВремени()
	Если ДанныеСреднемесячнойНормыОтредактированы(ЭтотОбъект) Тогда
		Если СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную Тогда
			ДанныеОСреднемесячнойНормеЗаписи = РеквизитФормыВЗначение("СреднемесячныеНормыВремениГрафиковРаботыСотрудников");
			ДанныеОСреднемесячнойНормеЗаписи.Записать();
		Иначе 
			УчетРабочегоВремениРасширенный.ОбновитьСреднемесячныеНормыПоРежимуРаботы(Объект.Ссылка, НомерТекущегоГода, Истина);
		КонецЕсли;				
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ДанныеСреднемесячныеНормыВремениГрафиковРаботыСотрудников(ГрафикРаботыСотрудников, Знач Год)
	
	Год = ?(Год = 0, 1, Год);
	
	СтруктураЗаписи = Справочники.ГрафикиРаботыСотрудников.СреднемесячныеНормыВремени(ГрафикРаботыСотрудников, Дата(Год, 1, 1));
	Если Не ЗначениеЗаполнено(СтруктураЗаписи.Год) Тогда
		СтруктураЗаписи.Год = Год;
	КонецЕсли; 
	
	Возврат СтруктураЗаписи;

КонецФункции

&НаСервере
Процедура УстановитьОтображениеПолейСреднемесячныеНормыВремени()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПересчитатьСреднемесячныеЧислаЧасовИДней",
		"Видимость",
		СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную);
	
	Если СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную Тогда
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		ОтображениеПредупреждения = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СреднемесячныеНормыВремениГрафиковРаботыСотрудниковСреднемесячноеЧислоЧасов",
		"ОтображениеПредупрежденияПриРедактировании",
		ОтображениеПредупреждения);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СреднемесячныеНормыВремениГрафиковРаботыСотрудниковСреднемесячноеЧислоДней",
		"ОтображениеПредупрежденияПриРедактировании",
		ОтображениеПредупреждения);
		
КонецПроцедуры

&НаКлиенте
Процедура ГодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеСреднемесячнойНормыОтредактированы(ЭтотОбъект) Тогда
		Если Объект.Ссылка.Пустая() Тогда
			ТекстВопроса = НСтр("ru = 'Данные о среднемесячной нормы были отредактированы. Для сохранения данных, необходимо записать режим работы. 
	                             |Записать?'");
			
			Оповещение = Новый ОписаниеОповещения("НомерТекущегоГодаДляНовогоРежимаРаботыРегулированиеЗавершение", ЭтотОбъект, Направление);					
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Иначе
			ТекстВопроса = НСтр("ru = 'Данные о среднемесячной нормы были отредактированы. 
	                             |Сохранить изменения?'");
			
			Оповещение = Новый ОписаниеОповещения("НомерТекущегоГодаРаботыРегулированиеЗавершение", ЭтотОбъект, Направление);					
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);	
		КонецЕсли;	
	Иначе
		НомерТекущегоГода = НомерТекущегоГода + 1 * Направление;
		ПрочитатьСреднемесячныеНормыВремени();
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура НомерТекущегоГодаРаботыРегулированиеЗавершение(Ответ, Направление) Экспорт 
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьСреднемесячныеНормыВремени();	
	КонецЕсли;
	
	НомерТекущегоГода = НомерТекущегоГода + 1 * Направление;
	ПрочитатьСреднемесячныеНормыВремени();	
КонецПроцедуры

&НаКлиенте
Процедура НомерТекущегоГодаДляНовогоРежимаРаботыРегулированиеЗавершение(Ответ, Направление) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
	
		Если Не Объект.Ссылка.Пустая() Тогда
			ЗаписатьСреднемесячныеНормыВремени();;
		КонецЕсли;	
	КонецЕсли;
		
	НомерТекущегоГода = НомерТекущегоГода + 1 * Направление;
	ПрочитатьСреднемесячныеНормыВремени();	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеСреднемесячнойНормыОтредактированы(Форма)
	СреднемесячныеНормыВремениГрафиковРаботыСотрудников = Форма.СреднемесячныеНормыВремениГрафиковРаботыСотрудников;
	СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя = Форма.СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя;
	
	Если  СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную Тогда
		Возврат (СреднемесячныеНормыВремениГрафиковРаботыСотрудников.СреднемесячноеЧислоЧасов <> СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя.СреднемесячноеЧислоЧасов
				 Или СреднемесячныеНормыВремениГрафиковРаботыСотрудников.СреднемесячноеЧислоДней <> СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя.СреднемесячноеЧислоДней);
				 
	ИначеЕсли СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя <> Неопределено
		И СреднемесячныеНормыВремениГрафиковРаботыСотрудниковПрежняя.УстановленыВРучную Тогда
		
		Возврат Истина;
	Иначе 	
		Возврат Ложь;
	КонецЕсли;					 
КонецФункции	

&НаСервере
Процедура ОбновитьСреднемесячныеНормыВремени()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Справочники.РежимыРаботыСотрудников.СоздатьВТСреднемесячныеНормыВремени(Запрос.МенеджерВременныхТаблиц, Объект.Ссылка, НомерТекущегоГода);
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСреднемесячныеНормыВремени";
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СреднемесячныеНормыВремениГрафиковРаботыСотрудников, Выборка);
		СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную = Ложь;
	Иначе
		СреднемесячныеНормыВремениГрафиковРаботыСотрудников.СреднемесячноеЧислоДней = 0;
		СреднемесячныеНормыВремениГрафиковРаботыСотрудников.СреднемесячноеЧислоЧасов = 0;
	КонецЕсли;	
	
	СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную = Ложь;
	УстановитьОтображениеПолейСреднемесячныеНормыВремени();	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДанныхГрафикаНаСервере(График)
	Если Объект.Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;	
	
	РежимРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(График, "РежимРаботы");
	
	Если РежимРаботы = Объект.Ссылка 
		И Не СреднемесячныеНормыВремениГрафиковРаботыСотрудников.УстановленыВРучную Тогда
		
		ОбновитьСреднемесячныеНормыВремени();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиСпискаСпособовЗаполнения()
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСменыРаботыСотрудников") Тогда
		Элементы.ВидГрафика.СписокВыбора.Добавить(Перечисления.СпособыЗаполненияГрафиковРаботыСотрудников.ПоСменам, НСтр("ru = 'По сменам'"));
	КонецЕсли;
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВводаШаблона(Форма)
	Если Форма.Объект.СпособЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияГрафиковРаботыСотрудников.ПоСменам") Тогда
		Форма.Элементы.ШаблонЗаполнения.Видимость = Истина;
	Иначе
		Форма.Элементы.ШаблонЗаполнения.Видимость = Ложь;
	КонецЕсли;		
КонецПроцедуры	


#КонецОбласти
